<template>
    <div>
        <PathNav :paths="[{url:'',name:'关于'}]"></PathNav>
        <div class="about">
            <h2 class="text-center">Just about me</h2>
            <div>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;李成，男，一个90后草根站长！13年高中毕业，从此踏入“美丽的人间天堂”,欣欣向往的大学，在大学，将近度过了3个年头。在这些日子，有苦有乐，付出了很多也收获了很多。
                    在高中的时候，觉得大学是个令人流连忘返的地方。每天日学夜学。终于考上了大学。然而这一切似乎和理想中的大学还是有着莫名的差距。我只能说理想是美好的，现实是残酷的！虽然如此，但是这个奋斗的历程却是我们毕生的财富。即使不被历史所铭记，但是也证明了你来过这个世界。。
                </p>
                <p>
                    人生就是一个得与失的过程，孟子在“鱼我所欲也”中说到：鱼与熊掌不可兼得！这意味着我们需要舍弃一些东西。然而实际情况上得到的永远比失去的多。当我选择了计算机专业的时候，便知道湖边共度月光，月下吟诗的时光都可能与我无缘了。但是我依然享受这个专业带来的乐趣，在这个专业中激发了兴趣，然后越走越远......
                </p>
                <p>
                    古语有云“工欲善其事必先利其器”，正所谓磨刀不误砍柴工。对于学习也一样，拥有一套自己的学习方法，再去学习东西，必定事半功倍。不过这一切都是在积累的过程。切莫认为方法一定要先于学习，两者间是相互依赖的。
                </p>
                <p>
                    世界之大，有容乃大。苍穹之下，必会有你的一片天地 ----By:李成
                </p>
            </div>
            <div class="text-center">
                <h2>About my blog</h2>
                <p>域 名：www.icoolstar.com 创建于2016年03月22日</p>
                <p>服务器：阿里云服务器</p>
            </div>
        </div>
    </div>
</template>
<script>

    import PathNav from '../components/PathNav.vue'

    export default{
        components: {
            PathNav
        },
    }
</script>